import { WordData } from "./wordsEasy";

export const wordsHard: WordData[] = [
  { kanji: "今日は良い天気ですね", kana: "きょうはよいてんきですね" },
  { kanji: "明日の予定は何ですか", kana: "あすのよていはなんですか" },
  {
    kanji: "日本語の勉強を頑張っています",
    kana: "にほんごのべんきょうをがんばっています",
  },
  {
    kanji: "新しいプロジェクトが始まりました",
    kana: "あたらしいぷろじぇくとがはじまりました",
  },
  {
    kanji: "週末に友達と映画を見に行きます",
    kana: "しゅうまつにともだちとえいがをみにいきます",
  },
  {
    kanji: "健康のために毎日運動しています",
    kana: "けんこうのためにまいにちうんどうしています",
  },
  {
    kanji: "彼の意見には賛成できません",
    kana: "かれのいけんにはさんせいできません",
  },
  {
    kanji: "この本はとても面白いです",
    kana: "このほんはとてもおもしろいです",
  },
  {
    kanji: "先週の旅行は楽しかったです",
    kana: "せんしゅうのりょこうはたのしかったです",
  },
  {
    kanji: "新しいレストランを試してみましょう",
    kana: "あたらしいれすとらんをためしてみましょう",
  },
];
